# Data Handling - Pandas
- 구조화된 데이터의 처리를 지원하는 Python 라이브러리
- Python계의 엑셀!
- 고성능 Array 계산 라이브러리인 Numpy와 통함하여, 강력한 "스프레트시트" 처리 기능을 제공
- 인덱싱, 연산용 함수, 전처리 함수 등을 제공
- Pandas는 Numpy의 Wrapper라서 Numpy의 기능을 그대로 사용 가능

In [1]:
import pandas as pd
import numpy as np

In [2]:
data_url = 'https://archive.ics.uci.edu/ml/machine-learning-databases/housing/housing.data'
df_data = pd.read_csv(data_url, sep = '\s+', header = None) # csv타입, separate는 빈공간, column이름이 없는 것
df_data.head() # 처음 다섯줄

,0,1,2,3,4,5,6,7,8,9,10,11,12,13
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

In [3]:
df_data.columns = [
    'CRIM','ZN', 'INDUS', 'CHAS', 'NOX', 'RM', 'AGE', 'DIS', 'RAD', 'TAX', 'PTRATIO' ,'B', 'LSTAT', 'MEDV'] 
# Column Header 이름 지정
df_data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0,0.538,6.575,65.2,4.0900,1,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0,0.469,6.421,78.9,4.9671,2,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0,0.469,7.185,61.1,4.9671,2,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0,0.458,6.998,45.8,6.0622,3,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0,0.458,7.147,54.2,6.0622,3,222.0,18.7,396.90,5.33,36.2

#### 실무에서는 Data팀이 따로 있지 않는 이상 csv구조가 아닌 DB에서 꺼내와야 한다.

In [4]:
df_data.values # pandas는 numpy이 wrapper이다.
print(type(df_data.values))

<class 'numpy.ndarray'>

## Pandas의 구성
- Series : DataFrame 중 하나인 Column에 해당하는 데이터의 모음 Object
- DafaFrame : Data Table 전체를 포함하는 Object, 일반적인 pandas활용에서는 기존 데이터를 불러와 생성한다.

### Series
- Column Vector를 표현하는 object
- index handling이 가능함
- Subclass of numpy.ndarray
- Data : any type
- index labels need not be ordered
- Duplicates are possible

In [5]:
from pandas import Series, DataFrame # Series라는 객체는 따로 있다.

In [6]:
list_data = [1,2,3,4,5]
example_obj = Series(data = list_data)
example_obj # index, data, dtype이 출력

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
# Data와 index이름을 지정
dict_data = {'a' : 1, 'b' : 2, 'c' : 3, 'd' : 4, 'e' : 5}
example_obj = Series(dict_data, dtype = np.float32, name = "exaple_data")
example_obj

a    1.0
b    2.0
c    3.0
d    4.0
e    5.0
Name: exaple_data, dtype: float32

In [8]:
# data index에 접근하기
example_obj['a']

1.0

In [9]:
# data index에 값 할당하기
example_obj['a'] = 3.2
example_obj

a    3.2
b    2.0
c    3.0
d    4.0
e    5.0
Name: exaple_data, dtype: float32

### Dataframe
- 기본적으로 2차원 구조(Numpy arrat와 유사)
- row(index)와 column의 값만 알면 Data에 접근이 가능하다.

In [10]:
# dict type으로 선언이 가능하다.
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'],
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'],
        'age': [42, 52, 36, 24, 73],
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}

# dict의 key값을 columns으로 지정
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [11]:
# 원하는 cloumn들만 선택할 수 있다.
DataFrame(raw_data, columns = ["age", "city"])

   age           city
0   42  San Francisco
1   52      Baltimore
2   36          Miami
3   24        Douglas
4   73         Boston

In [12]:
# 새로운 cloumn을 추가, Data는 NaN으로 채워짐
DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city', 'debt'])

  first_name last_name  age           city debt
0      Jason    Miller   42  San Francisco  NaN
1      Molly  Jacobson   52      Baltimore  NaN
2       Tina       Ali   36          Miami  NaN
3       Jake    Milner   24        Douglas  NaN
4        Amy     Cooze   73         Boston  NaN

In [13]:
# column 선택 - series 추출 2가지 방식이있음
df.first_name

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [14]:
df['first_name']

0    Jason
1    Molly
2     Tina
3     Jake
4      Amy
Name: first_name, dtype: object

In [15]:
# loc = index-location

# index = 1 인 값 가져옴
df.loc[1]

first_name        Molly
last_name      Jacobson
age                  52
city          Baltimore
Name: 1, dtype: object

In [16]:
# iloc = index-position

# "age" Series에서  1부터 값 뽑음
df["age"].iloc[1:]

1    52
2    36
3    24
4    73
Name: age, dtype: int64

#### loc와 iloc는 다르다! loc 는 이름 , iloc는 index number!!!

In [17]:
s = pd.Series(np.nan, index=[49,48,47,46,45, 1, 2, 3, 4, 5])
s

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
4    NaN
5    NaN
dtype: float64

In [18]:
# loc는 index이름이 3까지 가져옴
s.loc[:3]

49   NaN
48   NaN
47   NaN
46   NaN
45   NaN
1    NaN
2    NaN
3    NaN
dtype: float64

In [19]:
# iloc는 index 순서가 3까지 가져옴
s.iloc[:3]

49   NaN
48   NaN
47   NaN
dtype: float64

In [20]:
# numpy의 broadcasting 기능 사용가능
df.debt = df.age>40
df

<ipython-input-20-11fab32642af>:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.debt = df.age>40

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

In [21]:
df.T # transpose

                        0          1      2        3       4
first_name          Jason      Molly   Tina     Jake     Amy
last_name          Miller   Jacobson    Ali   Milner   Cooze
age                    42         52     36       24      73
city        San Francisco  Baltimore  Miami  Douglas  Boston

In [22]:
df.values # 값 출력

array([['Jason', 'Miller', 42, 'San Francisco'],
       ['Molly', 'Jacobson', 52, 'Baltimore'],
       ['Tina', 'Ali', 36, 'Miami'],
       ['Jake', 'Milner', 24, 'Douglas'],
       ['Amy', 'Cooze', 73, 'Boston']], dtype=object)

In [23]:
df.to_csv() # csv변환

',first_name,last_name,age,city\r\n0,Jason,Miller,42,San Francisco\r\n1,Molly,Jacobson,52,Baltimore\r\n2,Tina,Ali,36,Miami\r\n3,Jake,Milner,24,Douglas\r\n4,Amy,Cooze,73,Boston\r\n'

In [25]:
# column을 삭제하기
del df["city"]
df

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
2       Tina       Ali   36
3       Jake    Milner   24
4        Amy     Cooze   73

### Selection with column names

In [26]:
# 한개의 column 선택 - 상단부터 3개 가져오기 
df["age"].head(3)

0    42
1    52
2    36
Name: age, dtype: int64

In [27]:
df[["first_name","last_name","age"]].head(3)

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52
2       Tina       Ali   36

### Selection with index number

In [30]:
# column 이름 없이 사용하는 index number는 row기준 표시
df[:2]

  first_name last_name  age
0      Jason    Miller   42
1      Molly  Jacobson   52

In [36]:
# column 이름과 함께 row index 사용시, 해당 column만
df["age"][:2]

0    42
1    52
Name: age, dtype: int64

In [38]:
df = pd.read_excel("excel-comp-data.xlsx")
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
0,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

### Series selection

In [45]:
account_series = df["account"]
account_series[:3] # ~3 미만 index 까지

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [46]:
account_series[[0,1,2]] # index의 번호를 넣으면 1개이상의 해당 index호출 가능

0    211829
1    320563
2    648336
Name: account, dtype: int64

In [47]:
account_series[account_series<250000] # Boolean index

0     211829
3     109996
4     121213
5     132971
6     145068
7     205217
8     209744
9     212303
10    214098
11    231907
12    242368
Name: account, dtype: int64

In [50]:
# index 변경, 해당 data의 고유한 특징을 나타내는 Series로 index를 변경할 때
df.index = df["account"]
df.head()

,account,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,,
211829,211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [51]:
# index로 설정한 account가 그대로 남아있으므로 del
del df["account"]
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
account,,,,,,,,
211829,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
320563,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
648336,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
109996,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
121213,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

In [52]:
# Column과 index number
df[["name", "street"]][:2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [53]:
# Index의 값과 Column의 이름
df.loc[[211829, 320563],["name","street"]]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

In [54]:
# iloc을 사용해 column number만 사용
# 간단하나 data 숫자가 커지면 사용 힘들 수도 있음
df.iloc[:2, :2]

                               name              street
account
211829   Kerluke, Koepp and Hilpert  34456 Sean Highway
320563               Walter-Trantow   1311 Alvis Tunnel

### index 재설정

In [55]:
df.index = list(range(0,15))
df.head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
1,Walter-Trantow,1311 Alvis Tunnel,Port Khadijah,NorthCarolina,38365,95000,45000,35000
2,"Bashirian, Kunde and Price",62184 Schamberger Underpass Apt. 231,New Lilianland,Iowa,76517,91000,120000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000

### Data drop

In [60]:
# row 를 drop(없앨 때) / column단위로 없앨 때는 del을 사용

# 한개 이상의  Index number로 drop  
df.drop([1,2]).head()

,name,street,city,state,postal-code,Jan,Feb,Mar
0,"Kerluke, Koepp and Hilpert",34456 Sean Highway,New Jaycob,Texas,28752,10000,62000,35000
3,"D'Amore, Gleichner and Bode",155 Fadel Crescent Apt. 144,Hyattburgh,Maine,46021,45000,120000,10000
4,Bauch-Goldner,7274 Marissa Common,Shanahanchester,California,49681,162000,120000,35000
5,"Williamson, Schumm and Hettinger",89403 Casimer Spring,Jeremieburgh,Arkansas,62785,150000,120000,35000
6,Casper LLC,340 Consuela Bridge Apt. 400,Lake Gabriellaton,Mississipi,18008,62000,120000,70000

In [64]:
# axis를 지정해 축을 기준으로 drop 

# column중 "city"를 drop
df.drop("city", axis = 1).head(2)
df.drop(["city","street"], axis = 1).head(2)

# inplace = True를 설정해줘야 원본데이터 변환이 가능
# df.drop("city", axis = 1, inplace = True).head(2)

                         name          state  postal-code    Jan    Feb    Mar
0  Kerluke, Koepp and Hilpert          Texas        28752  10000  62000  35000
1              Walter-Trantow  NorthCarolina        38365  95000  45000  35000

### Series operation

In [67]:
s1 = Series(range(1, 6), index = list("abced"))
s1

a    1
b    2
c    3
e    4
d    5
dtype: int64

In [68]:
s2 = Series(range(5, 11), index = list("bcedef"))
s2

b     5
c     6
e     7
d     8
e     9
f    10
dtype: int64

In [69]:
s1.add(s2)# 이름이 같은것 끼리 더해주며 존재하지 않는 index는 NaN

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

In [70]:
s1 + s2

a     NaN
b     7.0
c     9.0
d    13.0
e    11.0
e    13.0
f     NaN
dtype: float64

### DataFrame operation

In [71]:
df1 = DataFrame(
    np.arange(9).reshape(3,3), 
    columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [72]:
df2 = DataFrame(
    np.arange(16).reshape(4,4), 
    columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### df 는 column과 index를 모두 고려 add operation을 쓰면 NaN값 0으로 변환  add, sub, div ,mul등 이 있다.

In [73]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

In [76]:
df1.add(df2, fill_value = 0) # 없는 값에는 0을 더해줌

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

### Series + Dataframe

In [77]:
df = DataFrame(
    np.arange(16).reshape(4,4), 
    columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [78]:
s = Series(
    np.arange(10,14), 
    index=list("abcd"))
s

a    10
b    11
c    12
d    13
dtype: int32

In [79]:
# column을 기준으로 broadcastiong이 발생
df + s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

In [82]:
# axis를 기준으로 row broadcastion 실행
s2 = Series(np.arange(10,14))
df.add(s2, axis= 0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28

## lambda, map, apply
- Pandas에서 편하게 자주 사용

### map for series
- pandas의 series type의 데이터에도 map 함수 사용가능
- function 대신 dict, sequence형 자료등으로 대체 가능

In [83]:
s1 = Series(np.arange(10))
s1.head(5)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [84]:
s1.map(lambda x : x**2).head(5)

0     0
1     1
2     4
3     9
4    16
dtype: int64

In [86]:
# 자주사용!!!
# map에 dict를 적용해 값을 key에 맞는 index의 Data 변환
z = {1: 'A', 2: 'B', 3: 'C'}
s1.map(z)

0    NaN
1      A
2      B
3      C
4    NaN
5    NaN
6    NaN
7    NaN
8    NaN
9    NaN
dtype: object

In [88]:
s2 = Series(np.arange(10, 20))
s1.map(s2) # s1의 각 index Data를 s2해당 index Data로 변경

0    10
1    11
2    12
3    13
4    14
5    15
6    16
7    17
8    18
9    19
dtype: int32

## Example
- map에 dict를 적용 하는 예시
- 분석 시 문자를 숫자로 변환

In [90]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [91]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [92]:
df["sex_code"] = df.sex.map({"male" : 0, "female" : 1}) # 성별을 0 1로 변경
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [94]:
# replace로도 사용가능
df.replace({"male" : 0, "female" : 1}).head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [97]:
# replace list로 사용
df.replace(["male", "female"],[0,1],inplace = True)
df.head()

           earn  height  sex   race  ed  age  sex_code
0  79571.299011   73.89    0  white  16   49         0
1  96396.988643   66.23    1  white  16   62         1
2  48710.666947   63.77    1  white  16   33         1
3  80478.096153   63.22    1  other  16   95         1
4  82089.345498   63.08    1  white  17   43         1

In [98]:
del df["sex_code"]
df.head()

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

### apply for dataframe
- map과 달리, series 전체(column)에 해당 함수를 적용
- 입력값이 series 데이터로 입력받아 handling 가능
- 내장 연산 함수를 사용할 때도 똑같은 효과를 거둘 수 있음
- mean, std등 사용가능
- scalar 값 이외에 series값의 반환도 가능함

In [99]:
df_info = df[["earn", "height", "age"]]
df_info.head()

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [100]:
f = lambda x : x.max() - x.min()
df_info.apply(f) # 해당 column의 max -min 통계를 낼 때 유용하게 사용 가능

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [104]:
df_info.sum()

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [105]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [111]:
def f(x):
    return Series([x.min(), x.max()], index = ["min", "max"])
df_info.apply(f)

              earn  height  age
min     -98.580489   57.34   22
max  317949.127955   77.21   95

### applymap for dataframe
- series 단위가 아닌 element 단위로 함수를 적용함
- series 단위에 apply를 적용시킬 때와 같은 효과

In [107]:
f = lambda x : -x
df_info.applymap(f).head(5)

           earn  height  age
0 -79571.299011  -73.89  -49
1 -96396.988643  -66.23  -62
2 -48710.666947  -63.77  -33
3 -80478.096153  -63.22  -95
4 -82089.345498  -63.08  -43

In [108]:
df_info["earn"].apply(f).head(5)

0   -79571.299011
1   -96396.988643
2   -48710.666947
3   -80478.096153
4   -82089.345498
Name: earn, dtype: float64

## Pandas Built-in functions

### describe
- Numeric type 데이터의 요약 정보를 보여줌

In [112]:
df = pd.read_csv("wages.csv")
df.head()

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [113]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

### unique
- series data의 유일한 값을 list로 반환함

In [114]:
# 유일한 인종의 값 list
df.race.unique()

array(['white', 'other', 'hispanic', 'black'], dtype=object)

In [117]:
# dict type으로 index
np.array(dict(enumerate(df["race"].unique())))

array({0: 'white', 1: 'other', 2: 'hispanic', 3: 'black'}, dtype=object)

In [121]:
# label 인코딩
# label index 값과 label값 각각 추출
value = list(map(int,np.array(list(enumerate(df["race"].unique())))[:, 0].tolist()))
key = np.array(list(enumerate(df["race"].unique())), dtype = str)[:, 1].tolist()
value, key

([0, 1, 2, 3], ['white', 'other', 'hispanic', 'black'])

## Data handling
- Data는 대부분 지저분한 형태이므로 전처리를 위해 pandas를 사용한다.

In [125]:
# data from: 
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings',
         'kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
         'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
         'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
         'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

df = pd.DataFrame(ipl_data)
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

### Groupby
- SQL groupby 명령어와 같다.
- split > apply > combine 과정을 거쳐 연산함
- 한 개 이상의 column을 묶을 수 있음

In [124]:
# Team : 묶음의 기준이 되는 Column
# Points : 적용받는 컬럼
# 결과 : Team을 기준으로 Points를 Sum(팀별 포인트 합)
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [126]:
# 한 개 이상의 column을 묶을 수 있음
# Team 마다 년도별 points 합

df.groupby(["Team", "Year"])["Points"].sum()

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

### Hierarchical index
- Groupby 명령으 결과물도 결국 dataframe이다.
- 두 개이 column으로 groupby를 할 경우, index가 두개 생성

In [129]:
h_index = df.groupby(["Team", "Year"])["Points"].sum()
h_index.index

MultiIndex([('Devils', 2014),
            ('Devils', 2015),
            ( 'Kings', 2014),
            ( 'Kings', 2016),
            ( 'Kings', 2017),
            ('Riders', 2014),
            ('Riders', 2015),
            ('Riders', 2016),
            ('Riders', 2017),
            ('Royals', 2014),
            ('Royals', 2015),
            ( 'kings', 2015)],
           names=['Team', 'Year'])

In [130]:
h_index.sum()

9187

In [131]:
h_index["Devils" : "Kings"]

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Name: Points, dtype: int64

### Hierarchical index - unstack()
- Group으로 묶여진 데이터를 matrix 형태로 전환해줌

In [136]:
print(h_index.head(3))
h_index.unstack()

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
Name: Points, dtype: int64

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0    NaN  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN
kings     NaN  812.0    NaN    NaN

### Hierarchical index - swaplevel
- Index level을 변경할 수 있다.

In [141]:
h_index.swaplevel()

Year  Team
2014  Devils    863
2015  Devils    673
2014  Kings     741
2016  Kings     756
2017  Kings     788
2014  Riders    876
2015  Riders    789
2016  Riders    694
2017  Riders    690
2014  Royals    701
2015  Royals    804
      kings     812
Name: Points, dtype: int64

In [150]:
h_index.swaplevel().sort_index(0)

Year  Team
2014  Devils    863
      Kings     741
      Riders    876
      Royals    701
2015  Devils    673
      Riders    789
      Royals    804
      kings     812
2016  Kings     756
      Riders    694
2017  Kings     788
      Riders    690
Name: Points, dtype: int64

### Hierarchical index - operations
- Index level을 기준으로 기본 연산 수행 가능

In [151]:
h_index.sum(level = 0)

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [152]:
h_index.sum(level = 1)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

## Groupby_2
- 크게 사용은 X

### Groupby - gropued
- Grouby에 의해 split된 상태를 추출 가능함
- 추출 된 group 정보에는 세 가지 유형의 apply가 가능
- Aggregation : 요약된 통계정보를 추출해줌
- Transformation : 해당 정보를 변환해줌
- Filtration : 특정 정보를 제거 하여 보여주는 필터링 기능

In [154]:
# Team 별로 나눔
grouped = df.groupby("Team")

for name, group in grouped:
    print(name)
    print(group)

Devils
     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673
Kings
    Team  Rank  Year  Points
4  Kings     3  2014     741
6  Kings     1  2016     756
7  Kings     1  2017     788
Riders
      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690
Royals
      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804
kings
    Team  Rank  Year  Points
5  kings     4  2015     812

### Groupby - aggregation
- lambda도 가능
- 특정 column에 여러개의 function을 apply할 수 도 있다.

In [155]:
# 그룹별 합
grouped.agg(sum)

        Rank  Year  Points
Team
Devils     5  4029    1536
Kings      5  6047    2285
Riders     7  8062    3049
Royals     5  4029    1505
kings      4  2015     812

In [156]:
# 그룹 별 평균
grouped.agg(np.mean)

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [157]:
grouped["Points"].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
Devils  1536  768.000000  134.350288
Kings   2285  761.666667   24.006943
Riders  3049  762.250000   88.567771
Royals  1505  752.500000   72.831998
kings    812  812.000000         NaN

### Groupby - transformation
- Agregation과 달리 key값 별로 요약된 정보가 아님
- 개별 데이터의 변환을 지원함

In [160]:
# group별 정규분포
score = lambda x :(x - x.mean() / x.std())
grouped.transform(score)

        Rank        Year      Points
0  -2.500000  452.800413  867.393596
1  -1.500000  453.800413  780.393596
2  -1.535534 -834.933221  857.283600
3  -0.535534 -833.933221  667.283600
4   1.556624  694.436418  709.273068
5        NaN         NaN         NaN
6  -0.443376  696.436418  724.273068
7  -0.443376  697.436418  756.273068
8  -1.500000  454.800413  685.393596
9   2.821489 -834.933221  690.668003
10 -0.178511 -833.933221  793.668003
11 -1.500000  455.800413  681.393596

### Groupby - filter
- 특정 조건으로 데이터를 검색할 때 사용
- filter안에는 boolean조건이 존재해야함
- len(x)는 grouped된 dataframe개수
- 자주 사용 O

In [163]:
# Data가 3개이상 있는 것만 , 3명이상 있는 팀만
df.groupby("Team").filter(lambda x : len(x) >= 3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

### Pivot Table
- Gropuby에서 한것들을 Pivot Table로도 할 수 있다.

In [165]:
import dateutil

df_phone = pd.read_csv("phone_data.csv")
df_phone['date'] = df_phone['date'].apply(dateutil.parser.parse, dayfirst=True)
df_phone.head()

   index                date  duration  item    month   network network_type
0      0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1      1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2      2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3      3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4      4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile

In [167]:
# duration의 Data에서 moth, item / network column선택 후 sum으로 aggregation한다.
df_phone.pivot_table(["duration"],
                     index=[df_phone.month,df_phone.item], 
                     columns=df_phone.network, aggfunc="sum", fill_value=0)

             duration                                                   \
network        Meteor Tesco  Three Vodafone      data landline special
month   item
2014-11 call     1521  4045  12458     4316     0.000     2906       0
        data        0     0      0        0   998.441        0       0
        sms        10     3     25       55     0.000        0       1
2014-12 call     2010  1819   6316     1302     0.000     1424       0
        data        0     0      0        0  1032.870        0       0
        sms        12     1     13       18     0.000        0       0
2015-01 call     2207  2904   6445     3626     0.000     1603       0
        data        0     0      0        0  1067.299        0       0
        sms        10     3     33       40     0.000        0       0
2015-02 call     1188  4087   6279     1864     0.000      730       0
        data        0     0      0        0  1067.299        0       0
        sms         1     2     11       23     0.000        0       2
2015-03 call      274   973   4966     3513     0.000    11770       0
        data        0     0      0        0   998.441        0       0
        sms         0     4      5       13     0.000        0       0


network      voicemail world
month   item
2014-11 call       301     0
        data         0     0
        sms          0     0
2014-12 call       690     0
        data         0     0
        sms          0     4
2015-01 call       285     0
        data         0     0
        sms          0     0
2015-02 call       268     0
        data         0     0
        sms          0     0
2015-03 call       231     0
        data         0     0
        sms          0     3

### Crosstab
- 특히 두 column의 교차 빈도, 비율, 덧셈 등을 구할 때 사용
- Pivot table의 특수한 형태
- User-Item Rating Matrix 등을 만들 때 사용 가능함

In [169]:
df_movie = pd.read_csv("movie_rating.csv")
df_movie.head()

          critic               title  rating
0  Jack Matthews   Lady in the Water     3.0
1  Jack Matthews   Snakes on a Plane     4.0
2  Jack Matthews   You Me and Dupree     3.5
3  Jack Matthews    Superman Returns     5.0
4  Jack Matthews  The Night Listener     3.0

In [170]:
# Pivot Table생성
df_movie.pivot_table(["rating"], index=df_movie.critic, columns=df_movie.title, aggfunc="sum", fill_value=0)

                    rating                                      \
title         Just My Luck Lady in the Water Snakes on a Plane
critic
Claudia Puig           3.0               0.0               3.5
Gene Seymour           1.5               3.0               3.5
Jack Matthews          0.0               3.0               4.0
Lisa Rose              3.0               2.5               3.5
Mick LaSalle           2.0               3.0               4.0
Toby                   0.0               0.0               4.5


title         Superman Returns The Night Listener You Me and Dupree
critic
Claudia Puig               4.0                4.5               2.5
Gene Seymour               5.0                3.0               3.5
Jack Matthews              5.0                3.0               3.5
Lisa Rose                  3.5                3.0               2.5
Mick LaSalle               3.0                3.0               2.0
Toby                       4.0                0.0               1.0

In [177]:
# corsstab 생성
# index에는 critic을 / column에는 title / values(data) 는 rating을 넣어준뒤 aggfuc와 fillna 설정

pd.crosstab(index=df_movie.critic,columns=df_movie.title,values=df_movie.rating,aggfunc="first").fillna(0)

title,Just My Luck,Lady in the Water,Snakes on a Plane,Superman Returns,The Night Listener,You Me and Dupree
critic,,,,,,
Claudia Puig,3.0,0.0,3.5,4.0,4.5,2.5
Gene Seymour,1.5,3.0,3.5,5.0,3.0,3.5
Jack Matthews,0.0,3.0,4.0,5.0,3.0,3.5
Lisa Rose,3.0,2.5,3.5,3.5,3.0,2.5
Mick LaSalle,2.0,3.0,4.0,3.0,3.0,2.0
Toby,0.0,0.0,4.5,4.0,0.0,1.0

In [178]:
# 실제 데이터에서는 is_null()로 없는 데이터를 걸러준다.
# df = df[df["index"].isnull() == False]

### Merge
- SQL에서 많이 사용하는 Merge와 같은 기능
- 두 개의 데이터를 하나로 합침
- 여러 데이터에 같은 대상의 정보가 흩어져있을 때 사용

In [182]:
raw_data = {
        'subject_id': ['1', '2', '3', '4', '5', '7', '8', '9', '10', '11'],
        'test_score': [51, 15, 15, 61, 16, 14, 15, 1, 61, 16]}
df_a = pd.DataFrame(raw_data, columns = ['subject_id', 'test_score'])

raw_data = {
        'subject_id': ['4', '5', '6', '7', '8'],
        'first_name': ['Billy', 'Brian', 'Bran', 'Bryce', 'Betty'], 
        'last_name': ['Bonder', 'Black', 'Balwner', 'Brice', 'Btisan']}
df_b = pd.DataFrame(raw_data, columns = ['subject_id', 'first_name', 'last_name'])

In [183]:
pd.merge(df_a, df_b, on = "subject_id")

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

In [184]:
# 두 dataframe이 column이름이 다를 때
pd.merge(df_a, df_b, left_on='subject_id', right_on='subject_id')

  subject_id  test_score first_name last_name
0          4          61      Billy    Bonder
1          5          16      Brian     Black
2          7          14      Bryce     Brice
3          8          15      Betty    Btisan

In [185]:
pd.merge(df_a, df_b, on='subject_id', how='left')

  subject_id  test_score first_name last_name
0          1          51        NaN       NaN
1          2          15        NaN       NaN
2          3          15        NaN       NaN
3          4          61      Billy    Bonder
4          5          16      Brian     Black
5          7          14      Bryce     Brice
6          8          15      Betty    Btisan
7          9           1        NaN       NaN
8         10          61        NaN       NaN
9         11          16        NaN       NaN

### Index based join
- Index를 살리고 싶을 때

In [186]:
pd.merge(df_a, df_b, right_index=True, left_index=True)

  subject_id_x  test_score subject_id_y first_name last_name
0            1          51            4      Billy    Bonder
1            2          15            5      Brian     Black
2            3          15            6       Bran   Balwner
3            4          61            7      Bryce     Brice
4            5          16            8      Betty    Btisan

## Concat
- 같은 형태의 데이터를 붙이는 연산 작업 (Numpy와 동일)

## DB Persistence

### Database connection
- Data loading시 db connection 기능을 제공함

In [188]:
# Database연결 코드
import sqlite3 #pymysql <- 설치

conn = sqlite3.connect("flights.db") # connections 생성
cur = conn.cursor()
cur.execute("select * from airlines limit 5;")
results = cur.fetchall()
results

[(0, '1', 'Private flight', '\\N', '-', None, None, None, 'Y'),
 (1, '2', '135 Airways', '\\N', None, 'GNL', 'GENERAL', 'United States', 'N'),
 (2, '3', '1Time Airline', '\\N', '1T', 'RNX', 'NEXTIME', 'South Africa', 'Y'),
 (3,
  '4',
  '2 Sqn No 1 Elementary Flying Training School',
  '\\N',
  None,
  'WYT',
  None,
  'United Kingdom',
  'N'),
 (4, '5', '213 Flight Unit', '\\N', None, 'TFU', None, 'Russia', 'N')]

In [190]:
# 속도를 위해 파일 형태로 저장
df_airplines = pd.read_sql_query("select * from airlines;", conn)
df_airports = pd.read_sql_query("select * from airports;", conn)
df_routes = pd.read_sql_query("select * from routes;", conn)
df_airplines.head()

,index,id,name,alias,iata,icao,callsign,country,active
0,0,1,Private flight,\N,-,None,None,None,Y
1,1,2,135 Airways,\N,None,GNL,GENERAL,United States,N
2,2,3,1Time Airline,\N,1T,RNX,NEXTIME,South Africa,Y
3,3,4,2 Sqn No 1 Elementary Flying Training School,\N,None,WYT,None,United Kingdom,N
4,4,5,213 Flight Unit,\N,None,TFU,None,Russia,N

### XLS persistence
- Dataframe의 엑셀 추출 코드
- Xls 엔진으로 openpyxls 또는 xlsxWrite사용

### Pickle persistence
- 가장 일반적인 python 파일 persistence
- to_pickle, read_pickle 함수 사용